"""
Константные значения используемые алгоритмом

@author Sergey Vakhrameev
"""

# веса событий пользователей на сайте
WEIGHTS = {
    'watch_sale': '1',
    'create_buy': '10',
    'create_up_buy': '10',
    'edit_up_buy': '10',
    'activity_trade': '5',
    'activity_company': '5',
    'activity_profile': '5',
    'message': '10',
    'callButtonTrade': '10',
    'order_from_trade': '10',
    'order_from_catalogue': '10',
    'watch_buy': '0',
    # 'search': 50
    }

# индексы сотрудников Инлайн
ADMIN_USERS = [2, 7, 10, 14903, 16005, 34272, 36832, 55508, 55678, 56709, 81860, 94154, 96104,
99194, 101444, 104849, 135786, 144792, 166055, 171344, 172753, 204902, 207281, 211701, 212080,
224268, 225329, 233862, 234008, 239509, 253278, 254481, 258944, 259162, 259654, 260854, 260961,
261124, 261198, 261527, 261870, 262575, 263064, 263659, 263668, 263744, 264599, 266938, 267284]
