"""
Словари и другие текстовые данные для обработки мониториингов

@author Sergei Romanov
"""

meat_type_map = {
    1: "Баранина",
    2: "Говядина",
    3: "Свинина",
    4: "Птица"
}

column_mapping = {
    'Регион': 'region',
    'Наименование': 'product',
    'Описание': 'description',
    'Зам./ Охл.': 'temperature_state',
    'Страна': 'country',
    'Упаковка': 'packaging',
    'Наличие': 'availability',
    'Партия': 'batch',
    'Условия поставки': 'delivery_terms',
    'Цена': 'price',
    'Компания': 'company',
    'Вид деятельности': 'activity_type',
    'Телефон': 'phone',
    'Контактное лицо': 'contact_person',
    'E-mail': 'email',
    'Город': 'city',
    'Дата': 'date',
    'Категория': 'product_type',
    'Сорт/Категория': 'sort',
    'Сертификация': 'certification',
    'Детали продукта': 'product_details'
}

old_column_mapping = {'Регион/ область': 'Регион',
                      'Регион/область': 'Регион',
                      'Наим-ие': 'Наименование',
                      'Наимен.': 'Наименование',
                      'Наимен-ие': 'Наименование',
                      'Вес.уп.': 'Упаковка',
                      'Вес. уп.': 'Упаковка',
                      'Упак.': 'Упаковка',
                      'Ус. поставки': 'Условия поставки',
                      'Усл. поставки': 'Условия поставки',
                      'Усл.поставки': 'Условия поставки',
                      'Конт.лицо': 'Контактное лицо',
                      'Еmail': 'E-mail',
                      'МЫЛО': 'E-mail',
                      'Зам./ охл.': 'Зам./ Охл.',
                      'Охл./ зам.': 'Зам./ Охл.',
                      'Зам./охл.': 'Зам./ Охл.',
                      'Зам./ охл': 'Зам./ Охл.',
                      'Зам/ охл': 'Зам./ Охл.',
                      'Зам/охл': 'Зам./ Охл.',
                      'Наличин': 'Наличие',
                      'Конт. лицо': 'Контактное лицо'}

subfolders = ['centralMeat', 'mskMeat', 'sibirMeatfederal',
              'southMeat', 'spbMeat', 'szfoMeat', 'uralMeat', 'volgaMeat', 'exchange']
drop_cols = ['Холдинг', 'Холдинги', 'Агрохолдинг', 'Разделка', 'Произ-ль', 'Кат.', 'Кaт.', 'Мин. партия',
             'Минимал. партия', 'Min партия', 'Объем партии', ' минимальная партия', 'Произв-ль', 'Произв',
             'Партия/усл. поставки']

# Папка для файлов с новыми мониторингами
source_folder = '/hosting/new/meat'
# Папка для успешно обработанных файлов
processed_folder = '/hosting/processed/meat'
# Папка для файлов с ошибками
errors_folder = f'/hosting/errors/meat'

categories_mapping = {
    'Говядина': ['Говядина', 'Телятина', 'Буйволятина', 'Кролик', 'Конина'],
    'Свинина': ['Свинина', 'Свиньи'],
    'Баранина': ['Баранина', 'Ягнятина'],
    'Птица': ['Кура', 'Цыпленок', 'Утка', 'Индейка', 'Цесарка', 'Гусь', 'Перепел', 'Страус', 'Фазан']
}

product_details_patterns = {
    'замороженное': r'\bзам(?:ороженн(?:ый|ое|ые|ая))?\.?\b|зам\.\s*[.)]',
    'охлажденное': r'\bохл(?:ажд[её]нн(?:ый|ое|ые|ая))?\.?\b|охл\.\s*[.)]',

    # условились на том что 'бк' будут интерпретироваться и как 'без кожи' и как 'без кости' (в зависимости от контекста)
    'бк': r'(?:(?<!\w)бк(?!\w))|(?:без\s+кост\w*)|(?:без\s+кож\w*)',

    'нк': r'(?:(?<!\w)нк(?!\w))|(?:на\s+кост\w*)',
    'задние/задняя': r'\bзадн\w*\b',
    'передние/передняя': r'\bпередн\w*\b',
    'грубая': r'\bгруб\w*\b',
    'мягкая': r'\bмягк\w*\b',
    'становая': r'\bстанов\w*\b',
    'внутренний/внутренняя': r'\bвнутренн\w*',
    'корпусной': r'корпусн\w*',
    'кишечный': r'кишечн\w*',
    'chuck': r'(?:chuck|\bчак\b)',
    '1 сорт': r'(?:1\s+сорт|1сорт)',
    '2 сорт': r'(?:2\s+сорт|2сорт)',
    'высший сорт': r'высший\s+сорт',
    'экстра': r'экстра',
    'котлетное': r'\bкотлетн\w*\b',
    'головной/головная': r'головн\w*',
    'компенсат': r'компенсат\w*',
    'односортное': r'односортн\w*',
    'мясная': r'^(?!.*\b(первая|уральская)\s+мясная\s+компания\b).*\bмясн\w*(?!\s+(двор|дом|магнат))\b',
    '1 кат': r'1\s+кат',
    '2 кат': r'2\s+кат',
    'быки': r'\b(бык|быки)\b',
    'коровы': r'\b(корова|коровы)\b',
    'ленточное': r'\bленточн\w*\b',
    'зачищен': r'\bзачищ\w*\b',
    'не зачищен': r'\bне\s+зачищ\w*\b',
    '70/30': r'70/30',
    '80/20': r'80/20',
    '50/50': r'50/50',
    '60/40': r'60/40',
    '90/10': r'90/10',
    'МО': r'(?:механ\w*\s+обвалк\w*)|(?:(?<!\w)мо(?!\w))|(?:(?<!\w)ммо(?!\w))|(?:мехобвалк\w*)',
    'толстый': r'толст\w*',
    'тонкий': r'тонк\w*',
    'без языка': r'без\s+язык\w*',
    'цельная': r'цельн\w*',
    'ограбленная': r'(?<!\bне)(?<!\bне\ )ограблен\w*',
    'без шкуры': r'без\s+шкур\w*',
    'на шкуре': r'на\s+шкур\w*',
    'без хребта': r'без\s+хребт\w*',
    'с хребтом': r'с\s+хребт\w*',
    'копчиковые/копчиковый': r'копчиков\w*',
    'пищевая/пищевой': r'(?<!\S)(пищев(?:ая|ой))(?!\s+промышлен\w+)(?=\b)',
    'суповая/суповой': r'супов\w*',
    'техническая/технический': r'техническ\w*',
    'на хрящах': r'на\s+хрящ\w*',
    'без голяшки': r'без\s+голяшк\w*',
    'вертолет': r'\bвертол[её]т\w*\b',
    'подлопаточное': r'подлопаточн\w*',
    'треугольник': r'треугольник\w*',
    'на ребре': r'на\s+р[её]бр\w*',
    'боковой/боковая': r'боков\w*',
    'ск': r'(?:(?<!\w)ск(?!\w))|(?:с\s+кож\w*)',
    '2 фаланги': r'2\s+фаланг\w*',
    '3 фаланги': r'3\s+фаланг\w*',
    'плечо': r'плеч\w*',
    'хребтовая/хребтовой': r'хребтов\w*',
    'халяль': r'\bхаляль\b',
    'мясокостный/мясокостная': r'мясокостн\w*',
    'домашняя': r'(?<!по)(?<!по-)(?<!по\ )домашн\w*',
    'корнишон': r'корнишон\w*',
    'несушка': r'несушк\w*',
    'малое': r'мал\w*',
    'мелкокусковое': r'мелкокусков\w*',
    'локтевая часть': r'локтев\w*',
    'голени': r'голен\w*',
    '4 ребра': r'4\s+р[её]бр\w*',
    '8 ребер': r'8\s+р[её]бер',
    'каре': r'\bкаре\b',
    'молодняк': r'молодняк\w*'
}

MEAT = 'meat'
historical_columns = ['id', 'product', 'description', 'price', 'product_type', 'temperature_state', 'federal_okrug',
                      'sort', 'certification', 'company', 'date', 'activity_type']

csv_file_categories = ['product', 'description', 'temperature_state', 'country', 'price', 'company', 'activity_type',
                       'date', 'federal_okrug', 'category', 'product_details', 'product_type', 'file_name']


def get_classification_string(df):
    return (f'Классифицировано {df["product_type"].notna().sum()} из {df.shape[0]}, записей не классифицировано '
            f'{df["product_type"].isna().sum()} ({round(df["product_type"].isna().sum() / df.shape[0] * 100, 2)} %)')
