import re
from nltk.stem.snowball import SnowballStemmer

stemmer = SnowballStemmer(language='russian')


def automapping(categories_list):
    stems = [stemmer.stem(word) for word in categories_list]

    categories_mapping = {}
    for original, stem in zip(categories_list, stems):
        stem_words = stem.split()

        if len(stem_words) == 1:
            # для 1 слова
            pattern_str = r'(?i)\b{}\b'.format(re.escape(stem_words[0]))
        else:
            # для строки
            lookaheads = [r'(?=.*\b{}\b)'.format(re.escape(word))
                          for word in stem_words]
            pattern_str = r'(?i)' + ''.join(lookaheads) + '.*'

        compiled_pattern = re.compile(pattern_str)
        categories_mapping[compiled_pattern] = original

    return categories_mapping


mapping_dict = {
    'охлажд': 'охл',
    'охлажден': 'охл',
    'крабычvici': 'крабыч vici',
    'бланширова': 'бланш',
    'блоч': 'блок',
    'блочн': 'блок',
    'гкрабочк': 'крабочк',
    'заморож': 'замор',
    'заморожен': 'замор',
    'заморозк': 'замор',
    'ст.б.': 'стеклянная банка',
    'ст./банка': 'стеклянная банка',
    'маринист': ' ',
    'потраш': 'потрошеный',
    'потрошон': 'потрошеный',
    'целыевареные': 'целые вареные',
    'ястыкгорбушипод': 'ястык горбуши под',
    'целыеварен': 'целые вареные',
    'кальмарфаршированный': 'кальмар фаршированный',
    'макрурурса': 'макруруса',
    'воммер': 'вомер',
    'гольц': 'голец',
    'гренадир': 'гренадер',
    'палтук': 'палтус',
    'путасу': 'путассу',
    'кабаякижар': 'кабаяки жар',
    'нагет': 'наггетс',
    'нагетс': 'наггетс',
    'наггетц': 'наггетс',
}

# fish_type ===================================================================

fish_type = [
    'Анадара', 'Белуга', 'Бонито', 'Бротолла', 'Вобла',
    'Вомер', 'Голец', 'Гренадер', 'Густера', 'Дорадо', 'Дори', 'Жерех',
    'Игла', 'Император', 'Кахавай', 'Кижуч', 'Килька',
    'Конгрио', 'Корбикула', 'Корюшка', 'Красноглазка', 'Красноперка',
    'Кунджа', 'Кларий', 'Лакедра', 'Ледяная', 'Лемонема', 'Лещ', 'Линь', 'Лосось',
    'Луциан', 'Марлин', 'Меч', 'Мидии', 'Минтай', 'Мойва', 'Молочная',
    'Навага', 'Налим', 'Нерка', 'Окунь',
    'Пангасиус', 'Пелядь', 'Пикша', 'Плотва', 'Попугай',
    'Рубио', 'Рыбец', 'Ряпушка', 'Саворин', 'Сазан', 'Сайка', 'Салака',
    'Сардина', 'Сибас', 'Синец', 'Скумбрия', 'Сладкогуб',
    'Таранка', 'Терпуг', 'Тилапия', 'Трубач', 'Тугун',
    'Тюрбо', 'Угольная', 'Угорь', 'Хек',
    'Чехонь', 'Чир', 'Щука', 'Язь'
]

fish_type_mapping = automapping(fish_type)
fish_type_mapping.update(
    {
        r'^(?!.*\b(?:пал[а-яё]*|\bмяс[а-яё]*)\b).*\bкраб[а-яё]*?\b.*$': 'Краб',
        r'\bбараб[а-яё]*\b': 'Барабльука',
        r'\bтреск[а-яё]*\b': 'Треска',
        r'\bугр[а-яё]*\b': 'Угорь',
        r'\b[а-яё]*лосос[а-яё]*\b': 'Лосось',
        r'\bкрев[а-яё]*\b': 'Креветка',
        r'\bминт[а-яё]*\b': 'Минтай',
        r'\bкальмаров[а-яё]*\b': 'Кальмар',
        r'\bналим[а-яё]*\b': 'Налим',
        r'\bгорб[а-яё]*\b': 'Горбуша',
        r'\bкальма[а-яё]*\b': 'Кальмар',
        r'\bжелт[а-яё]*(?:\s+\S+)*\s+\bполос[а-яё]*\b|\bцарс[а-яё]*(?:\s+\S+)*\s+\bполос[а-яё]*\b': 'Желтый Полосатик',
        r'\bзубар[а-яё]*\b|\bзубат[а-яё]*\b': 'Корюшка',
        r'\bкамб[а-яё]*\b': 'Камбала',
        r'\bкамб[а-яё]*(?:\s+\S+)*\s+\bерш[а-яё]*\b': 'Камбала-ерш',
        r'\bкет[а-яё]*\b': 'Кета',
        r'\bкефа[а-яё]*\b': 'Кефаль',
        r'\bмасля[а-яё]*\b': 'Масляная',
        r'\bомул[а-яё]*\b': 'Омуль',
        r'\bосетр[а-яё]*\b': 'Осетр',
        r'\bпутас[а-яё]*\b': 'Путассу',
        r'\bсайд[а-яё]*\b': 'Сайда',
        r'\bсайр[а-яё]*\b': 'Сайра',
        r'\bсардинел[а-яё]*\b': 'Сардинелла',
        r'\bсельд[а-яё]*\b': 'Сельдь',
        r'\bсемг[а-яё]*\b': 'Семга',
        r'\bсиг[а-яё]*\b': 'Сиг',
        r'\bставр[а-яё]*\b': 'Ставрида',
        r'\bсуда[а-яё]*\b': 'Судак',
        r'\bтун[а-яё]*\b': 'Тунец',
        r'\bулит[а-яё]*\b': 'Улитка',
        r'\bфоре[а-яё]*\b': 'Форель',
        r'\bхек[а-яё]*\b': 'Хек',
        r'\bшпро[а-яё]*\b': 'Шпроты',
        r'\bпалт[а-яё]*': 'Палтус'
    }
)

# fish_type_alias =============================================================
fish_type_alias = [
    'Пеламида',
    # 'Паламут',
    'Жерих',
    # 'Шереспер',
    'Зубатка пестрая',
    # 'Рыба игла',
    # 'Луциан',
    # 'Камбала морская',
    'Балтийская килька',
    'Корюшка азиатская',
    'Корюшка зубастая',
    'Корюшка балтийская',
    'Корюшка европейская',
    'Краб стригун',
    'Краб камчатский',
    'Желтохвост',
    # 'Щуковидная белокровка',
    # 'Белокровная щука',
    'Лосось атлантический',
    # 'Красный луциан',
    'Макрурус',
    'Эсколар',
    # 'Меченос',
    # 'Рыба-меч', # меч рыба
    'Ханос',
    # 'Окунь атлантический',
    'Окунь морской',
    'Палтус черный',
    'Палтус стрелозубый',
    'Пангасиус белый',
    # 'Рыба-попугай',
    # 'Сырть',
    # 'Варехоу',
    # 'Салка балтийская',
    'Иваси',  # 'Сардина иваси'
    # 'Скумбрия морская',
    'Треска атлантическая',
    'Тугунок',
    'Лудога',
    # 'Аноплопома',
    'Угорь морской',
    'Форель морская',
    'Щекур'
]

fish_type_alias_mapping = automapping(fish_type_alias)
fish_type_alias_mapping.update(
    {
        r'^(?=.*\bпалтус(?:а|у|ом)?\b)(?=.*\bстрелозуб(?:а|ом|ый)?\b).+$': 'Палтус стрелозубый',
        r'^(?=.*\bкальмар[а-яё]*\b)(?=.*\bкомандорск[а-яё]*\b).+$': 'Кальмар командорский',
        r'\bжерих\b': 'Жерих',
        r'\bзубатк\b\s+\bпестр\b': 'Зубатка пестрая',
        r'\bбалтийск\b\s+\bкильк\b': 'Балтийская килька',
        r'\bкорюшк\w*\s+\bазиатск\b': 'Корюшка азиатская',
        r'\bкорюшк\w*\s+\bзубаст\b': 'Корюшка зубастая',
        r'\bкорюшк\w*\s+\bбалтийск\b': 'Корюшка балтийская',
        r'\bкорюшк\w*\s+\bевроп\b|\bкорюшк\w*\s+\bевропейск\b': 'Корюшка европейская',
        r'\bлос\w*\s+\bатлантическ\b': 'Лосось атлантический',
        r'\bокун\w*\s+\bморск\b': 'Окунь морской',
        r'\bпалтус\w*\s+\bсин\w*\s+\bкор\b': 'Палтус синекорый',
        r'\bсельд\w*\s+\bатлантическ\b': 'Сельдь атлантическая',
        r'\bскумбр\w*\s+\bатлантическ\b': 'Скумбрия атлантическая',
        r'\bтреск\w*\s+\bатлантическ\b': 'Треска атлантическая',
        r'\bугор\w*\s+\bморск\b': 'Угорь морской',
        r'\bфорел\w*\s+\bморск\b': 'Форель морская',
        r'\bаральск\w*\s+\bполосатик\b': 'Аральский полосатик',
    }
)
# product_type ================================================================

product_type = [
    'Гедза', 'Ассорти', 'Балык', 'Биточки', 'Икра',
    'Икриски', 'Кабаяки', 'Кнели', 'Коктейль', 'Кипперс',
    'Кубик', 'Купаты', 'Кусочки',
    'Мелкокусковое мясо', 'Мясо мидии', 'Мясо салатное',
    'Нарезка', 'Нори', 'Паутинка', 'Паштет',
    'Пельмени', 'Печень', 'Пицца',
    'Пласт', 'Рагу', 'Ромштекс', 'Рыбки', 'Салат', 'Слайсы',
    'Сосиски', 'Срезки', 'Стейк', 'Стружка', 'Сугудай',
    'Сырье', 'Тарт', 'Тарталетки', 'Теша', 'Фигурки', 'Фрикадельки',
    'Чипсы', 'Чука', 'Шашлык', 'Шашлычок', 'Шлеммер', 'Шницель', 'Юкола',
]

product_type_mapping = {}
product_type_mapping = automapping(product_type)
product_type_mapping.update(
    {
        r'^(?=.*\bкраб[а-яё]*\b)(?=.*\b(?:палоч)[а-яё]*\b).+$': 'Крабовые палочки',
        r'^(?=.*\bкраб[а-яё]*\b)(?=.*\b(?:мяс)[а-яё]*\b).+$': 'Крабовое мясо',
        r'^(?=.*\bнабо[а-яё]*\b)(?=.*\b(?:суп|ух)[а-яё]*\b).+$': 'Суповой набор',
        r'^(?=.*\bмяс[а-яё]*\b)(?=.*\b(?:салат)[а-яё]*\b).+$': 'Мясо салатное',
        r'^(?!.*\b(?:суп[а-яё]*|ух)\b).*\bнабор[а-яё]*?\b.*$': 'Набор',
        r'^(?!.*\b(?:краб[а-яё]*)\b).*\bпалоч[а-яё]*?\b.*$': 'Палочки',
        r'\bбалы[а-яё]*\b': 'Балык',
        r'\bбалы[а-яё]*\b': 'Бургер',
        r'\bзакуск[а-яё]*\b': 'Закуска',
        r'\bколба[а-яё]*\b': 'Колбаса',
        r'\bкольц[а-яё]*\b': 'Кольца',
        r'\bполукольц[а-яё]*\b': 'Кольца',
        r'\bкотле[а-яё]*\b': 'Котлеты',
        r'\bломт[а-яё]*\b': 'Ломтики',
        r'\bмедал[а-яё]*\b': 'Медальоны',
        r'\bмук(?:\s+\S+)*\s+\bкорм[а-яё]*\b': 'Мука кормовая',
        r'\bмук(?:\s+\S+)*\s+\bрыб[а-яё]*\b': 'Мука рыбная',
        r'\bмяс(?:\s+\S+)*\s+\bмид[а-яё]*\b': 'Мясо мидии',
        r'\bшпаж[а-яё]*\b': 'На шпажке',
        r'\bнаггет[а-яё]*\b': 'Наггетсы',
        r'\bрулет[а-яё]*\b': 'Рулет',
        r'\bрулет[а-яё]*\b': 'Соломка',
        r'\bтреуг[а-яё]*\b': 'Треугольник',
        r'\bфрикад[а-яё]*\b': 'Фрикадельки',
        r'\bшашлы[а-яё]*\b': 'Шашлык',
        r'^(?!.*\b(?:блок[а-яё]*|\bмонол[а-яё]*)\b).*\bфарш[а-яё]*?\b.*$': 'Фарш',
        r'^(?=.*\bфарш[а-яё]*\b)(?=.*\b(?:монол)[а-яё]*\b).+$': 'Фарш (монолит)',
        r'^(?=.*\bфарш[а-яё]*\b)(?=.*\b(?:блок)[а-яё]*\b).+$': 'Фарш (блок)',
    }
)

# smoking =====================================================================

smoking_mapping = {
    r'\bкопч вялен\b': 'Копчено-вяленый',
    r'\bхолодн копчен\b': 'Холодное копчение',
    r'\bхолод/коп\b': 'Холодное копчение',
    r'\bх/к\b|\bхк\b': 'Холодное копчение',
    r'\bхолод/копередн\b': 'Холодное копчение',
    r'\bхолод/копчен\b': 'Холодное копчение',
    r'\bг/к\b': 'Горячее копчение',
    r'\bсуш/вял\b': 'Сушено-вяленый',
    r'\bвялен\b': 'Вяленый',
    r'\bсуш\b': 'Сушеный',
    r'\bсол сушен\b': 'Солено-сушеный',
    r'\bс/c\b': 'Слабосоленый',
    r'\bс/к\b|\bсырокопчен\b': 'Сырокопченый',
    r'\bп/к\b': 'Полукопченый',
    r'\bн/к\b': 'Натурального копчения',
    r'\bс/дым\b': 'С дымком',
    r'\bподкоп\b': 'Подкопченый',
    r'\bбарб\b': 'Барбекю',
    r'\bкопч\b': 'Копченый',
    r'\bбал\b': 'Балык'
}

# cutting =====================================================================

cutting_type = [
    'Без кожи',
    'Бабочка',
    'Брюшки',
    'Голова',
    'Джерки',
    'Кусок',
    'Молоки',
    'Не потрошеная',
    'Обрезь',
    'Потрошенаяпотрошеная без головы',
    'Потрошеная с головой',
    'Пятачки',
    'С головой',
    'Спинка',
    'Трим',
    'Тушка',
    'Щупальца',
    'Хвост',
    'Хвостовая часть',
    'Целый',
    'Ястык'
]

cutting_mapping = {}
cutting_mapping = automapping(cutting_type)
cutting_mapping.update(
    {
        r'\b(без[а-яё]*\b.*\bкож[а-яё]*)|\bб/к\b': 'Без кожи',
        r'\bфил[а-яё]*\b[\s-]+(?:н/шк?|на\w*)\b[\s-]+(?:шкур?|кож)\b': 'Филе на коже',
        r'\bбрюш[а-яё]*\b': 'Брюшки',
        r'\b(?:куск|кусочк)\b': 'Кусок',
        r'\bне\b\s+\bпотрошен\b': 'Не потрошеная',
        r'\bпотрошен\w*\b\s+без\w*\s+\bгол\b': 'Потрошеная без головы',
        r'\bпотрошен\w*\b\s+\bб/г\b|\bпбг\b|\bпб/г\b': 'Потрошеная без головы',
        r'\bпс/г\b': 'Потрошеная с головой',
        r'\bс/г\b|\bс\b\s+\bголов\b': 'С головой',
        r'\bхвост[а-яё]*\b\s+част[а-яё]*\b': 'Хвостовая часть',
        r'\bхреб[а-яё]*\b': 'Хребты',
        r'\bфил\b': 'Филе',
        r'\bястыч[а-яё]*\b': 'Ястык',
        r'\bб/г\b': 'Без головы',
    }
)
# cook_method =================================================================

cooking_method = [
    'В панировке',
    'В раковине',
    'В створках',
    'В тесте',
    'Вареный',
    'Варено-мороженный',
    'Вялка',
    'Замороженный',
    'Консервированный',
    'Охлаждённый',
    'Парной',
    'Пресервы',
    'Фаршированный'
]

cook_method_mapping = {}
cook_method_mapping = automapping(cooking_method)
cook_method_mapping.update(
    {
        r'\bс/м\b': 'Свежемороженый',
        r'\bпанир[а-яё]*\b': 'В панировке',
        r'\bраковин[а-яё]*\b': 'В раковине',
        r'\bствор[а-яё]*\b': 'В створках',
        r'\bтест[а-яё]*\b': 'В тесте',
        r'\bв/м\b': 'Варено-мороженый',
        r'\bконсервац[а-яё]*\b': 'Консервированный',
        r'\bсу\b\s+вид\b': 'Су-вид',
        r'\bжар[а-яё]*\b': 'Жареный',
    }
)

# filling =====================================================================

filling_type = [
    'В соусе',
    'В томате/в томатном соусе (т/ц)',
    'Натуральный',
    'В масле',
    'В маринаде',
    'Со специями',
    'В заливке',
    'С овощами',
    'В собственном соку',
    'В рассоле',
    'В бульоне',
    'В кляре',
    'С петрушкой',
    'С морск. кап. (морской капустой)',
    'С грибами'
]

filling_mapping = {
    r'\b(том[а-яё]*\b.*\bсоус[а-яё]*)|(соус[а-яё]*\b.*\bтоматн[а-яё]*)\b|\bт/с\b': 'В томатном соусе',
    r'\b(собст[а-яё]*\b.*\bсок[а-яё]*)|(сок[а-яё]*\b.*\bсобст[а-яё]*)\b': 'В собственном соку',
    r'\b(майонезн[а-яё]*\b.*\bгорчичн[а-яё]*)|(горчичн[а-яё]*\b.*\bмайонезн[а-яё]*)\b': 'В майонезно-горчичном соусе',
    r'\b(мор[а-яё]*\b.*\bкапуст[а-яё]*)|(капуст[а-яё]*\b.*\bмор[а-яё]*)\b': 'С морской капустой',
    r'\b(соус[а-яё]*\b.*\bбарбек[а-яё]*)\b': 'В соусе барбекю',
    r'\b(грибн[а-яё]*\b.*\bсоус[а-яё]*)|(соус[а-яё]*\b.*\bгрибн[а-яё]*)\b': 'В грибном соусе',
    r'\bсоус\b': 'В соусе',
    r'\bнат\b': 'Натуральный',
    r'\bмасл\b': 'В масле',
    r'\bмарин\b': 'В маринаде',
    r'\bспец\b': 'Со специями',
    r'\bзалив\b': 'В заливке',
    r'\bовощ\b': 'С овощами',
    r'\bчеремш\b': 'С черемшой',
    r'\bрассол\b': 'В рассоле',
    r'\bбульон\b': 'В бульоне',
    r'\bкляр\b': 'В кляре',
    r'\bпетрушк\b': 'С петрушкой',
    r'\bгриб\b': 'С грибами',
}

# boxing ======================================================================
boxing_mapping = {
    r'\bвак/у\b': 'Вакуумная упаковка',
    r'\bв/у\b': 'Вакуумная упаковка',
    r'\bс/б\b': 'Стеклянная банка',
    r'\bст/б\b': 'Стеклянная банка',
    r'\bст\b\s+\bбанк\b': 'Стеклянная банка',
    r'\bстекло\b': 'Стекло',
    r'\bведро\b': 'Ведро',
    r'\bп/э\b': 'Полиэтилен',
    r'\bлоток\b': 'Лоток',
    r'\bп/пакет\b': 'Полиэтиленовый пакет',
    r'\bна подложке\b': 'На подложке',
    r'\bж/б\b': 'Жестяная банка',
    r'\bпэт\b': 'ПЭТ-пакет',
}

semiprocessed_expected_columns = ['product', 'description', 'country', 'packaging', 'availability', 'batch',
                                  'delivery_terms', 'price', 'company', 'activity_type', 'phone', 'contact_person',
                                  'email', 'date', 'federal_okrug', 'category', 'week_number', 'file_name',
                                  'temperature_state', 'fish_type', 'fish_type_alias', 'cutting', 'sort',
                                  'product_type', 'cook_method', 'boxing', 'smoking', 'filling']
