"""
Константы для модели предсказания заинтересованных покупателей
@author Dmitry Abramov
"""

# Названия колонок датасета userStat
USERSTAT_COLUMNS = ['userId', 'userRegion', 'type', 'offerId', 'dealType', 'type1', 'type2', 'offerRegion', 'date']

# Названия колонок датасета mailing
MAILING_COLUMNS = ['email', 'userId', 'sent', 'open', 'date_sent', 'date_open']

# Индексы сотрудников компании
ADMIN_USERS = [2, 7, 10, 14903, 16005, 34272, 36832, 55508, 55678, 56709, 81860, 94154, 96104,
99194, 101444, 104849, 135786, 144792, 166055, 171344, 172753, 204902, 207281, 211701, 212080,
224268, 225329, 233862, 234008, 239509, 253278, 254481, 258944, 259162, 259654, 260854, 260961,
261124, 261198, 261527, 261870, 262575, 263064, 263659, 263668, 263744, 264599, 266938, 267284]
